In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'Sex':['M','F','F','D','?'],
                  'Age':[29,30,24,290,25]})

In [3]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [4]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [5]:
df['Sex'].replace('D', 'F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [7]:
df['Sex'].replace({'D': 'F', 'N': 'M'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [9]:
df.replace({'Sex':{'D':'F', 'N':'M'},'Age':{290:29}})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   ?   25

In [10]:
df[df['Age'] > 100]

  Sex  Age
3   D  290

In [11]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [12]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25